TrampolineRTOS/trampoline/machines/cortex-m/armv7em/efm32wg/emlib/inc/em_usart.h
  /** Select if to operate in master or slave mode. */
  bool                    master;

  /** Select if to send most or least significant bit first. */
  bool                    msbf;

  /** Clock polarity/phase mode. */
  USART_ClockMode_TypeDef clockMode;

#if defined(USART_INPUT_RXPRS) && defined(USART_TRIGCTRL_AUTOTXTEN)
  /** Enable USART Rx via PRS. */
  bool                    prsRxEnable;

  /** Select PRS channel for USART Rx. (Only valid if prsRxEnable is true). */
  USART_PrsRxCh_TypeDef   prsRxCh;

  /** Enable AUTOTX mode. Transmits as long as RX is not full.
   *  If TX is empty, underflows are generated. */
  bool                    autoTx;
#endif
#if defined(_USART_TIMING_CSHOLD_MASK)
  /** Auto CS enabling */
  bool                    autoCsEnable;
  /** Auto CS hold time in baud cycles */
  uint8_t                 autoCsHold;
  /** Auto CS setup time in baud cycles */
  uint8_t                 autoCsSetup;
#endif
} USART_InitSync_TypeDef;

/** Default config for USART sync init structure. */
#if defined(_USART_TIMING_CSHOLD_MASK)
#define USART_INITSYNC_DEFAULT                                                              \
  {                                                                                         \
    usartEnable,     /* Enable RX/TX when init completed. */                                \
    0,               /* Use current configured reference clock for configuring baudrate. */ \
    1000000,         /* 1 Mbits/s. */                                                       \
    usartDatabits8,  /* 8 databits. */                                                      \
    true,            /* Master mode. */                                                     \
    false,           /* Send least significant bit first. */                                \
    usartClockMode0, /* Clock idle low, sample on rising edge. */                           \
    false,           /* Not USART PRS input mode. */                                        \
    usartPrsRxCh0,   /* PRS channel 0. */                                                   \
    false,           /* No AUTOTX mode. */                                                  \
    false,           /* No AUTOCS mode */                                                   \
    0,               /* Auto CS Hold cycles */                                              \
    0                /* Auto CS Setup cycles */                                             \
  }
#elif defined(USART_INPUT_RXPRS) && defined(USART_TRIGCTRL_AUTOTXTEN)
#define USART_INITSYNC_DEFAULT                                                              \
  {                                                                                         \
    usartEnable,     /* Enable RX/TX when init completed. */                                \
    0,               /* Use current configured reference clock for configuring baudrate. */ \
    1000000,         /* 1 Mbits/s. */                                                       \
    usartDatabits8,  /* 8 databits. */                                                      \
    true,            /* Master mode. */                                                     \
    false,           /* Send least significant bit first. */                                \
    usartClockMode0, /* Clock idle low, sample on rising edge. */                           \
    false,           /* Not USART PRS input mode. */                                        \
    usartPrsRxCh0,   /* PRS channel 0. */                                                   \
    false            /* No AUTOTX mode. */                                                  \
  }
#else
#define USART_INITSYNC_DEFAULT                                                              \
  {                                                                                         \
    usartEnable,     /* Enable RX/TX when init completed. */                                \
    0,               /* Use current configured reference clock for configuring baudrate. */ \
    1000000,         /* 1 Mbits/s. */                                                       \
    usartDatabits8,  /* 8 databits. */                                                      \
    true,            /* Master mode. */                                                     \
    false,           /* Send least significant bit first. */                                \
    usartClockMode0  /* Clock idle low, sample on rising edge. */                           \
  }
#endif

/** IrDA mode init structure. Inherited from asynchronous mode init structure */
typedef struct {
  /** General Async initialization structure. */
  USART_InitAsync_TypeDef  async;

  /** Set to invert Rx signal before IrDA demodulator. */
  bool                     irRxInv;

  /** Set to enable filter on IrDA demodulator. */
  bool                     irFilt;

  /** Configure the pulse width generated by the IrDA modulator as a fraction
   *  of the configured USART bit period. */
  USART_IrDAPw_Typedef     irPw;

  /** Enable the PRS channel selected by irPrsSel as input to IrDA module
   *  instead of TX. */
  bool                     irPrsEn;

  /** A PRS can be used as input to the pulse modulator instead of TX.
   *  This value selects the channel to use. */
  USART_IrDAPrsSel_Typedef irPrsSel;
} USART_InitIrDA_TypeDef;

/** Default config for IrDA mode init structure. */
#if defined(_USART_TIMING_CSHOLD_MASK) && defined(USART_CTRL_MVDIS)
#define USART_INITIRDA_DEFAULT                                                               \
  {                                                                                          \
    {                                                                                        \
      usartEnable,    /* Enable RX/TX when init completed. */                                \
      0,              /* Use current configured reference clock for configuring baudrate. */ \
      115200,         /* 115200 bits/s. */                                                   \
      usartOVS16,     /* 16x oversampling. */                                                \
      usartDatabits8, /* 8 databits. */                                                      \
      usartEvenParity,/* Even parity. */                                                     \
      usartStopbits1, /* 1 stopbit. */                                                       \
      false,          /* Do not disable majority vote. */                                    \
      false,          /* Not USART PRS input mode. */                                        \
      usartPrsRxCh0,  /* PRS channel 0. */                                                   \
      false,          /* Auto CS functionality enable/disable switch */                      \
      0,              /* Auto CS Hold cycles */                                              \
      0               /* Auto CS Setup cycles */                                             \
    },                                                                                       \
    false,            /* Rx invert disabled. */                                              \
    false,            /* Filtering disabled. */                                              \
    usartIrDAPwTHREE, /* Pulse width is set to ONE. */                                       \
    false,            /* Routing to PRS is disabled. */                                      \
    usartIrDAPrsCh0   /* PRS channel 0. */                                                   \
  }
#elif defined(USART_INPUT_RXPRS) && defined(USART_CTRL_MVDIS)
#define USART_INITIRDA_DEFAULT                                                               \
  {                                                                                          \
    {                                                                                        \
      usartEnable,    /* Enable RX/TX when init completed. */                                \
      0,              /* Use current configured reference clock for configuring baudrate. */ \
      115200,         /* 115200 bits/s. */                                                   \
      usartOVS16,     /* 16x oversampling. */                                                \
      usartDatabits8, /* 8 databits. */                                                      \
      usartEvenParity,/* Even parity. */                                                     \
      usartStopbits1, /* 1 stopbit. */                                                       \
      false,          /* Do not disable majority vote. */                                    \
      false,          /* Not USART PRS input mode. */                                        \
      usartPrsRxCh0   /* PRS channel 0. */                                                   \
    },                                                                                       \
    false,            /* Rx invert disabled. */                                              \
    false,            /* Filtering disabled. */                                              \
    usartIrDAPwTHREE, /* Pulse width is set to ONE. */                                       \
    false,            /* Routing to PRS is disabled. */                                      \
    usartIrDAPrsCh0   /* PRS channel 0. */                                                   \
  }
#else
#define USART_INITIRDA_DEFAULT                                                               \
  {                                                                                          \
    {                                                                                        \
      usartEnable,    /* Enable RX/TX when init completed. */                                \
      0,              /* Use current configured reference clock for configuring baudrate. */ \
      115200,         /* 115200 bits/s. */                                                   \
      usartOVS16,     /* 16x oversampling. */                                                \
      usartDatabits8, /* 8 databits. */                                                      \
      usartEvenParity,/* Even parity. */                                                     \
      usartStopbits1  /* 1 stopbit. */                                                       \
    },                                                                                       \
    false,            /* Rx invert disabled. */                                              \
    false,            /* Filtering disabled. */                                              \
    usartIrDAPwTHREE, /* Pulse width is set to ONE. */                                       \
    false,            /* Routing to PRS is disabled. */                                      \
    usartIrDAPrsCh0   /* PRS channel 0. */                                                   \
  }
#endif

#if defined(_USART_I2SCTRL_MASK)
/** I2S mode init structure. Inherited from synchronous mode init structure */
typedef struct {
  /** General Sync initialization structure. */
  USART_InitSync_TypeDef   sync;

  /** I2S mode. */
  USART_I2sFormat_TypeDef  format;

  /** Delay on I2S data. Set to add a one-cycle delay between a transition
   *  on the word-clock and the start of the I2S word.
   *  Should be set for standard I2S format. */
  bool                     delay;

  /** Separate DMA Request For Left/Right Data. */
  bool                     dmaSplit;

